Autodesk.Navisworks.Api.Plugins.CommandRecord
Represents the definition of a command in the GUI system

Autodesk.Navisworks.Api.Plugins.CommandRecord.CanToggle
Specifies if the command can toggle

Autodesk.Navisworks.Api.Plugins.CommandRecord.DisplayName
The text to be displayed for this command

Autodesk.Navisworks.Api.Plugins.CommandRecord.ExtendedToolTip
The extended tooltip to be displayed for this command

Autodesk.Navisworks.Api.Plugins.CommandRecord.Icon
The 16x16 icon to be displayed for this command

Autodesk.Navisworks.Api.Plugins.CommandRecord.Id
The full Id of the command. This is a combination of
and Plugin.Id

Autodesk.Navisworks.Api.Plugins.CommandRecord.LargeIcon
The 32x32 icon to be displayed for this command

Autodesk.Navisworks.Api.Plugins.CommandRecord.Shortcut
Specifies the keyboard shortcut for the command.

Autodesk.Navisworks.Api.Plugins.CommandRecord.ShortcutWindowTypes
The Ids of the windows for which the shortcut is valid.
Multiple Ids can be specified by separating with ";".
If Ids are specified the shortcut should be valid in all contexts.

Autodesk.Navisworks.Api.Plugins.CommandRecord.ToolTip
The tooltip to be displayed for this command